"""KeyError ---> Дава грешка , когато няма намерен ключ в речник.

AttributeError ---->

ValueError ----> Дава грешка , когато получи грешен тип на данните, например -> ако се иска инт, а получи флоат

NameError ----> Дава грешка , когато се опитаме да използваме някаква променлива , която не съществува.

TypeError ----> Дава грешка , когато получи грешен тип на данните

IndexError ----> Дава грешка , когато използваме слайсинг и е извън рейндж

ModuleNotFoundError ----> Дава грешка , когато няма намерен модул

ZeroDivisionError ----> Дава грешка , когато делим на нула

RuntimeError ----> Дава грешка , когато се появи грешка , която не се обхваща от никой друг exception

FileNotFoundError ----> Дава грешка , когато се опитаме да отворим файл, който не е намерен

OSError ----> Дава грешка , когато се опитаме да отворим файл, който може да бъде отворен само от администратора."""

